api-soap/soap-calculator.camel.yaml

- route:
    id: route-ec37
    from:
      id: from-af2e
      uri: rest
      parameters:
        method: post
        path: /calculator/add
        consumes: application/xml
        produces: application/xml
      steps:
        - setHeader:
            id: setHeader-a266
            name: Content-Type
            expression:
              constant:
                id: constant-cabe
                expression: text/xml; charset=utf-8
        - setHeader:
            id: setHeader-34a0
            name: SOAPAction
            expression:
              constant:
                id: constant-b82f
                expression: "\"http://tempuri.org/Add\""
        - setBody:
            id: setBody-4531
            expression:
              constant:
                id: constant-d738
                expression: >-
                  <soapenv:Envelope
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tem="http://tempuri.org/">
                     <soapenv:Header/>
                     <soapenv:Body>
                        <tem:Add>
                           <tem:intA>5</tem:intA>
                           <tem:intB>7</tem:intB>
                        </tem:Add>
                     </soapenv:Body>
                  </soapenv:Envelope>
        - to:
            id: to-93de
            uri: https
            parameters:
              bridgeEndpoint: true
              httpUri: www.dneonline.com/calculator.asmx
        - log:
            id: log-5247
            message: ${body}
        - setBody:
            id: setBody-4310
            expression:
              simple:
                id: simple-937e
                expression: ${body}
